# RunNamedDialogN

## Description
Displays the specified dialog with contextual help and initiates the dialog event loop. The dialog event loop is specified in a procedure subroutine that is passed as a parameter to the function.

```pascal
FUNCTION RunNamedDialogN(
				dialogID             : LONGINT;
				callback             : PROCEDURE;
				contextualHelpID     : STRING;
				enableContextualHelp : BOOLEAN) : LONGINT;
```

```python

def vs.RunNamedDialogN(dialogID, callback, contextualHelpID, enableContextualHelp):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The index of the dialog to be displayed|
|callback|PROCEDURE|The event loop subroutine for the dialog|
|contextualHelpID|STRING|The contextual help ID of the dialog|
|enableContextualHelp|BOOLEAN|Determines whether or not contextual help is accessible|

## Returns
Returns a LONGINT value indicating the button pressed to exit the dialog.

## See Also
VS Functions:
RunLayoutDialogN

## Version
Availability: from Vectorworks 2018
## Category
* Dialogs - Modern